Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabDbSwapOut Property
 Fabrication Database reload could not swap out for newer parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabDbSwapOut { get; }
Public Shared ReadOnly Property FabDbSwapOut As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabDbSwapOut {
	FailureDefinitionId^ get ();
}
static member FabDbSwapOut : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace